print("Привет")
name = input("Как тебя зовут?:")
print("Привет,", name + "!")
age = input("Сколько тебе лет?:")
print("Оу,", age + "!!!!!!!!!!," "Ты слишком стар чтобы учить Python((")
print("Ладно, я дам тебе один шанс!")
print("Но, ты должен пройти мой мега тест")
the_last_chance = "да"
ор_четыре = "4"
chance = input("Ты готов?!:")
if chance == the_last_chance:
    четыре = input("Сколько будет 2х2???:")
    if четыре == ор_четыре:
        print("Хм, а ты хорош! Думаю при должном старании ты сможешь выучить Python примерно через 500лет, продолжай в том же духе.")
    if четыре != ор_четыре:
        print("Так и знал, товй мозг уже давно привратился в холодец, тебе нужно принемать ноотропил три раза в день")
if chance != the_last_chance:
    print("Так и знал, товй мозг уже давно привратился в холодец, тебе нужно принемать ноотропил три раза в день.")
