m = {1:'Январь', 2:'Февраль', 3:'Март', 4:'Апрель', 5:'Май', 6:'Июнь', 7:'Июль', 8:'Август', 9:'Сентябрь', 10:'Октябрь', 11:'Ноябрь', 12:'Декабрь'}
n = {1:"Зима", 2:"Весна", 3:"Лето", 4:"Осень"}
key1 = int(input("Введите порядковый номер месяца:"))
print(m[key1])
if key1 == 1 or key1 == 2 or key1 == 12:
    print(n[1])
elif key1 == 3 or key1 == 4 or key1 == 5:
    print(n[2])
elif key1 == 6 or key1 == 7 or key1 == 8:
    print(n[3])
elif key1 == 9 or key1 == 10 or key1 == 11:
    print(n[4])